Тест_EDT/src/Catalogs/СпискиПокупок/СпискиПокупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпискиПокупок</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_EDT/src/InformationRegisters/СтатусыТоваров/СтатусыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыТоваров</name>
  <resources>
    <name>Исполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СписокТоваров</name>
    <type>
      <types>CatalogRef.СпискиПокупок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>110</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_EDT/src/Catalogs/СпискиПокупок/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ТоварыИсполненоПриИзменении(Элемент)
	Модифицированность = Ложь;
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыТоваров.Товар,
	|	СтатусыТоваров.Исполнено
	|ИЗ
	|	РегистрСведений.СтатусыТоваров КАК СтатусыТоваров
	|ГДЕ
	|	СтатусыТоваров.СписокТоваров = &СписокТоваров";
	
	Запрос.УстановитьПараметр("СписокТоваров", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Для Каждого СтрокаТовары Из Объект.Товары Цикл
			
			Если Выборка.НайтиСледующий(СтрокаТовары.Товар) Тогда
				СтрокаТовары.Исполнено = Выборка.Исполнено;
			КонецЕсли;
			
			Выборка.Сбросить();
			
		КонецЦикла; 
		
	КонецЕсли;
		
КонецПроцедуры
